app/controllers/posts_controller.rb

INSERT INTO "posts" ("tittle", "body", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["tittle", "dsaf"], ["body", "adffadf"], ["user_id", 1], ["created_at", "2018-05-19 21:18:44.993802"], ["updated_at", "2018-05-19 21:18:44.993802"]]
---
  def create
    @post = current_user.posts.new(post_params)

    respond_to do |format|
      if @post.save